var VkBot = require('node-vk-bot-api');
var Session = require('node-vk-bot-api/lib/session');
var newpost = require('./lib/onnewpost');
var app;
var bot;
//______________________ready___________________________________________________________________________________________
exports.vkstart = function () {
    console.log('vk ready');
    app = require('../app.js');
    bot = app.vkbot;
};
//______________________________________________________________________________________________________________________
//_______________message________________________________________________________________________________________________
/**ВХОДЯЩЕЕ СООБЩЕНИЕ
 *
 * @param ctx
 */
exports.vkmessage_new = function (ctx) {

};
/**НОВОЕ ИСХОЖЯЩЕЕ СООБЩЕНИЕ
 *
 * @param ctx
 */
exports.vkmessage_reply = function (ctx) {

};
/**РЕДАКТИРОВАНИЕ СООБЩЕНИЯ
 *
 * @param ctx
 */
exports.vkmessage_edit = function (ctx) {

};
/**ПОДПИСКА НА СООБЩЕНИЯ ОТ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkmessage_allow = function (ctx) {

};
/**ЗАПРЕТ СООБЩЕНИЙ ОТ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkmessage_deny = function (ctx) {

};
//______________________________________________________________________________________________________________________
//___________________photo______________________________________________________________________________________________
/**ДОБАВЛЕНИЕ ФОТОГРАФИИ
 *
 * @param ctx
 */
exports.vkphoto_new = function (ctx) {

};
/**ДОБАВЛЕНИЕ КОММЕНТАРИЯ К ФОТОГРАФИИ
 *
 * @param ctx
 */
exports.vkphoto_comment_new = function (ctx) {

};
/**РЕДАКТИРОВАНИЕ КОММЕНТАРИЯ К ФОТОГРАФИИ
 *
 * @param ctx
 */
exports.vkphoto_comment_edit = function (ctx) {

};
/**ВОСТАНОВЛЕНИЕ КОММЕНТАРИЯ К ФОТОГРАФИИ
 *
 * @param ctx
 */
exports.vkphoto_comment_restore = function (ctx) {

};
/**УДАЛЕНИЕ КОММЕНТАРИЯ К ФОТОГРАФИИ
 *
 * @param ctx
 */
exports.vkphoto_comment_delete = function(ctx){

};
//______________________________________________________________________________________________________________________
//____________________audio_____________________________________________________________________________________________
/**ДОБАВЛЕНИЕ АУДИОЗАПИСИ
 *
 * @param ctx
 */
exports.vkaudio_new = function (ctx) {

};
//______________________________________________________________________________________________________________________
//____________________video_____________________________________________________________________________________________
/**ДОБАВЛЕНИЕ ВИДЕО
 *
 * @param ctx
 */
exports.vkvideo_new = function (ctx) {

};
/**ДОБАВЛЕНИЕ КОММЕНТАРИЯ К ВИДЕО
 *
 * @param ctx
 */
exports.vkvideo_comment_new = function (ctx) {

};
/**РЕДАКТИРОВАНИЕ КОММЕНТАРИЯ К ВИДЕО
 *
 * @param ctx
 */
exports.vkvideo_comment_edit = function (ctx) {

};
/**ВОССТАНОВЛЕНИЕ КОММЕНТАРИЯ К ВИДЕО
 *
 * @param ctx
 */
exports.vkvideo_comment_restore = function (ctx) {

};
/**УДАЛЕНИЕ КОММЕНТАРИЯ К ВИДЕО
 *
 * @param ctx
 */
exports.vkvideo_comment_delete = function (ctx) {

};
//______________________________________________________________________________________________________________________
//_____________________wall post________________________________________________________________________________________
/**НОВОЯ ЗАПИСЬ НА СТЕНЕ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkwall_post_new = function (ctx) {

    newpost.commands(ctx);

};
/**РЕПОСТ ЗАПИСИ ИЗ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkwall_repost = function (ctx) {

};
//______________________________________________________________________________________________________________________
//______________________wall comments___________________________________________________________________________________
/**ДОБАВЛЕНИЕ КОММЕНТАРИЯ НА СТЕНЕ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkwall_reply_new = function (ctx) {

};
/**РЕДАКТИРОВАНИЕ КОММЕНТАРИЯ НА СТЕНЕ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkwall_reply_edit = function (ctx) {

};
/**ВОССТАНОВЛЕНИЕ КОММЕНТАРИЯ НА СТЕНЕ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkwall_reply_restore = function (ctx) {

};
/**УДАЛЕНИЕ КОММЕНТАРИЯ НА СТЕНЕ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkwall_reply_delete = function (ctx) {

};
//______________________________________________________________________________________________________________________
//________________________board_________________________________________________________________________________________
/**СОЗДАНИЕ КОММЕНТАРИЯ В ОБСУЖДЕНИИ
 *
 * @param ctx
 */
exports.vkboard_post_new = function (ctx) {

};
/**РЕДАКТИРОВАНИЕ КОММЕНТАРИЯ В ОБСУЖДЕНИИ
 *
 * @param ctx
 */
exports.vkboard_post_edit = function (ctx) {

};
/**ВОССТАНОВЛЕНИЕ КОММЕНТАРИЯ В ОБСУЖДЕНИИ
 *
 * @param ctx
 */
exports.vkboard_post_restore = function (ctx) {

};
/**УДАЛЕНИЕ КОММЕНТАРИЯ В ОБСУЖДЕНИИ
 *
 * @param ctx
 */
exports.vkboard_post_delete = function (ctx) {

};
//______________________________________________________________________________________________________________________
//_______________________market_________________________________________________________________________________________
/**ДОБАВЛЕНИЕ КОММЕНТАРИЯ В МАГАЗИНЕ
 *
 * @param ctx
 */
exports.vkmarket_comment_new = function (ctx) {

};
/**РЕДАКТИРОВАНИЕ КОММЕНТАРИЯ В МАГАЗИНЕ
 *
 * @param ctx
 */
exports.vkmarket_comment_edit = function (ctx) {

};
/**ВОССТАНОВЛЕНИЕ КОММЕНТАРИЯ В МАГАЗИНЕ
 *
 * @param ctx
 */
exports.vkmarket_comment_restore = function (ctx) {

};
/**УДАЛЕНИЕ КОММЕНТАРИЯ В МАГАЗИНЕ
 *
 * @param ctx
 */
exports.vkmarket_comment_delete = function (ctx) {

};
//______________________________________________________________________________________________________________________
//________________________users_________________________________________________________________________________________
/**ВЫХОД ОЛЬЗОВАТЕЛЯ ИЗ СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkgroup_leave = function (ctx) {

};
/**ВСТУПЛЕНИЕ ПОЛЬЗОВАТЕЛЯ В СООБЩЕСТВО
 *
 * @param ctx
 */
exports.vkgroup_join = function (ctx) {

};
/**БЛОКИРОВКА ПОЛЬЗОВАТЕЛЯ В СООБЩЕСТВЕ
 *
 * @param ctx
 */
exports.vkuser_block = function (ctx) {

};
/**РАЗБЛАКИРОВКА ПОЛЬЗОВАТЕЛЯ В СООБЩЕСТВЕ
 *
 * @param ctx
 */
exports.vkuser_unblock =function (ctx) {

};
//______________________________________________________________________________________________________________________
//_________________________group________________________________________________________________________________________
/**РЕДАКТИРОВАНИЕ В СПИСКЕ РУКОВОДСТВА СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkgroup_officers_edit = function(ctx){

};
/**РЕДАКТИРОВАНИЕ НАСТРОЕК СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkgroup_change_settings = function(ctx){

};
/**ИЗМЕНЕНИЕ ЗАГЛАВНОГО ФОТО СООБЩЕСТВА
 *
 * @param ctx
 */
exports.vkgroup_change_photo = function(ctx){

};
//______________________________________________________________________________________________________________________
//________________________another_______________________________________________________________________________________
/**ДОБАВЛЕНИЕ ГОЛОСА В ПУБЛИЧНОМ ОПРОСЕ
 *
 * @param ctx
 */
exports.vkpoll_vote_new = function (ctx) {

};
//______________________________________________________________________________________________________________________
//______________________________________________________________________________________________________________________